Repository: IET-OU/cloudengine
Catalog: system/application/language/*/LC_MESSAGES/application.po
Languages: el

source: !cloud-comment... <em>(in !title !time)</em>
el: !cloud-comment... <em>(στο !title !time)</em>

source: !cloud: for discussion, sharing and debate
el: !cloud: για συζητήση, ανταλλαγή ιδεών και επειχηρηματολογία γύρω από κάποιο θέμα

source: !cloudscape: for collecting, linking and following Clouds
el: !cloudscape: για συλλογή, διασύνδεση και λήψη ενημερώσεων για Clouds

source: !count comment
el: !count σχόλιο

source: !count comments
el: !count σχόλια

source: !count item requires moderation
el: !count αντικείμενο χρειάζεται επιτήρηση

source: !count items require moderation
el: !count αντικείμενα χρειάζονται επιτήρηση

source: !count view
el: !count επίσκεψη

source: !count views
el: !count προβολές

source: !field must be between !count and !count characters in length.
el: !field πρέπει να έχει μεταξύ !count και !count χαρακτήρες.

source: !following is now following !followed
el: Ο/Η !following έγινε follower του/της !followed

source: !link Using Apple's iPhoto to resize your picture and/ or file size
el: !link Χρήση του Apple's iPhoto για να αλλάξετε το μέγεθος της εικόνας και/ή το μέγεθος του αρχείου

source: !link Using Microsoft Office Picture Manager to compress a picture file
el: !link Χρήση του Microsoft Office Picture Manager για συμπίεση του αρχείου εικόνας

source: !link Using Microsoft Office Picture Manager to resize your picture
el: !link Χρήση του Microsoft Office Picture Manager για αλλαγή μεγέθους εικόνας

source: !name follows !count people.
el: Ο/Η !name ενημερώνεται για !count άτομα

source: !name's Clouds
el: Τα Clouds του/της !name

source: !person is followed by !count people.
el: Ο/Η !person έχει !count followers

source: !person's clouds
el: Τα clouds του/της !person

source: !person's cloudstream
el: Cloudstream του/της !person

source: !person's followers
el: Followers του/της !person

source: !person's follows
el: Follows του/της !person

source: !site-name! home page
el: Οικοσελίδα !site-name!

source: 1. Supporting conferences
el: 1. Υποστήριξη συνεδρίων

source: 2. Supporting workshops
el: 2. Υποστήριξη Εργαστηρίων

source: 3. Aggregating resources
el: 3. Συλλογή πηγών

source: 4. Sharing innovative learning and teaching ideas
el: 4. Ανταλλαγή καινοτόμων ιδεών για μάθηση και διδασκαλία

source: 5. Connect with others
el: 5. Συνδεθείτε με άλλους χρήστες

source: 6. Keep abreast of new developments
el: 6. Ενημερωθείτε για τις νέες εξελίξεις

source: <abbr title='!definition'>Cloud</abbr> created by: !person-date
el: <abbr title='!definition'>Cloud</abbr> δημιουργήθηκε από: !person-date

source: <abbr title='!definition'>Cloudscape</abbr> created by: !person
el: <abbr title='!definition'>Cloudscape</abbr> δημιουργήθηκε από: !person

source: A Cloud can be anything to do with learning and teaching. Each Cloud is 'social' in that it is possible to have a conversation around the Cloud. A Cloud could be: a short description of a learning and teaching idea, information about resources or tools for learning and teaching, detailed learning designs or case studies of practice or a question as a starting point for a discussion.
el: Ένα Cloud μπορεί να είναι οτιδήποτε σχετικό με εκμάθηση και διδασκαλία. Κάθε Cloud είναι 'κοινωνικό' υπό την έννοια ότι είναι δυνατόν να έχουμε μια συζήτηση γύρω από αυτό. Ένα Cloud θα μπορούσε να είναι: μια σύντομη περιγραφή μιας ιδέας για μάθηση και διδασκαλία, πληροφορίες σχετικά με πηγές ή εργαλεία για την εκμάθηση και τη διδασκαλία, λεπτομερή σχέδια μάθησης ή μελέτες περίπτωσης πρακτικών ή ένα ερώτημα που τίθεται ως αφετηρία για μια συζήτηση.

source: A Cloudscape is a collection of Clouds.
el: Ένα Cloudscape είναι μια συλλογή από Clouds.

source: About
el: Εισαγωγή

source: About Cloudworks
el: Για το Cloudworks

source: Academic References
el: Ακαδημαϊκές αναφορές

source: Account Activated
el: Ο λογαριασμός ενεργοποιήθηκε

source: Account Activation Failed
el: Η ενεργοποιήση του λογαριασμού σας απέτυχε

source: Active Clouds
el: Ενεργά Clouds

source: Add Cloud to Cloudscapes
el: Προσθήκη Cloud στο Cloudscape

source: Add Embedded Content
el: Προσθήκη Ενσωματωμένου Περιεχομένου

source: Add Extra Content
el: Προσθήκη επιπρόσθετου περιεχομένου

source: Add Link
el: Προσθήκη Link

source: Add Picture
el: Προσθήκη εικόνας

source: Add Reference
el: Προσθήκη αναφοράς

source: Add Tags
el: Προσθήκη ετικέτας

source: Add a Cloudscape Picture
el: Προσθήκη εικόνας Cloudscape

source: Add a Twitter feed
el: Προσθήκη Twitter feed

source: Add a link
el: Προσθήκη συνδέσμου

source: Add a link to the cloud !title
el: Προσθήκη συνδέσμου στο cloud !title

source: Add a section
el: Προσθήκη κατηγορίας

source: Add a section to the cloudscape !title
el: Προσθήκη κατηγορίας στο cloudscape !title

source: Add an academic reference
el: Προσθήκη ακαδημαϊκής αναφοράς

source: Add an academic reference to the cloud !title
el: Προσθήκη ακαδημαϊκής αναφοράς στο cloud !title

source: Add as admin
el: Προσθήκη ως διαχειριστή

source: Add as poster
el: Προσθήκη ως συντάκτη

source: Add clouds to a section
el: Προσθήκη clouds σε Κατηγορία

source: Add clouds to a section !title
el: Προσθήκη clouds στην κατηγορία !title

source: Add content
el: Προσθήκη περιεχομένου

source: Add embedded content
el: Προσθήκη ενσωματωμένου περιεχομένου

source: Add embedded content to the cloud !title
el: Προσθήκη ενσωματωμένου περιεχομένου στο cloud !title

source: Add extra content
el: Προσθήκη επιπρόσθετου περιεχομένου

source: Add extra content to the cloud !title
el: Προσθήκη επιπρόσθετου περιεχομένου στο cloud !title

source: Add link
el: Προσθήκη συνδέσμου

source: Add new user
el: Προσθήκη νέου χρήστη

source: Add news item
el: Προσθήκη Είδησης

source: Add one or more users as a 'poster' - this means they can add Clouds to an otherwise closed Cloudscape
el: Να προσθέσετε έναν ή περισσότερους χρήστες ως συντάκτες - αυτό σημαίνει ότι οι χρήστες αυτοί θα μπορούν να προσθέτουν Clouds στο Cloudscape παρόλο που θα είναι κλειστό

source: Add picture
el: Προσθήκη εικόνας

source: Add reference
el: Προσθήκη αναφοράς

source: Add section
el: Πρόσθηκη κατηγορίας

source: Add tags
el: Προσθήκη ετικετών

source: Add the !title cloud to a cloudscape
el: Προσθήκη του cloud !title σε cloudscape

source: Add to a Cloudscape
el: Προσθήκη σε Cloudscape

source: Add to cloudscape
el: Προσθήκη στο cloudscape

source: Admin cloudstream
el: Cloudstream του Διαχειρηστή

source: Administration
el: Διαχείριση

source: Admins
el: Διαχειρηστές

source: Agree and promote a hash (#) tag to be used for the conference, which can be used for Twitter, Blogs, Flckr etc.
el: Συμφωνήστε με και προωθήστε την χρήση ενός hash (#) tag για κάθε συνέδριο, η οποία μπορεί να χρησιμοποιηθεί για το Twitter, Blogs, Flckr κ.λπ.

source: All cloudscapes
el: Όλα τα cloudscapes

source: All the Clouds created by the people and Cloudscapes you are following are aggregated under your 'My Cloudstream'.
el: Το δικό σας Cloudstream αποτελείται από όλα τα Clouds που βρίσκονται κάτω από άτομα ή κάτω από τα Cloudscapes για τα οποία λαμβάνεται ενημερώσεις.

source: An email address can only be linked to one profile. If you want to set up another profile, for a group or course for example, you will have to choose a different address.
el: Μια διεύθυνση ηλεκτρονικού ταχυδρομείου μπορεί να συνδεθεί μόνο με ένα προφίλ. Αν θέλετε να δημιουργήσετε ένα άλλο προφίλ π.χ. για μια ομάδα ή για ένα μάθημα, θα πρέπει να επιλέξετε μια διαφορετική διεύθυνση.

source: An error occurred adding the new cloud. Please contact the Cloudworks team at !email!
el: Προέκυψε σφάλμα κατά την προσθήκη νέου cloud. Παρακαλώ επικοινωνήστε με την ομάδα του Cloudworks στο !email!

source: An error occurred.
el: Παρουσιάστηκε σφάλμα

source: Apologies if your !item has been accidentally flagged - we will attempt to moderate it as soon as possible.
el: Απολογούμαστε εάν το !item σας έχει επισημανθεί ως ακατάλληλο κατά λάθος - θα προσπαθήσουμε να το διασαφηνίσουμε την κατάστασή του το συντομότερο δυνατό.

source: Are you sure that you want to delete the following comment?
el: Είστε σίγουρος ότι θέλετε να διαγράψετε το ακόλουθο σχόλιο;

source: Are you sure that you want to delete the following content?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε το ακόλουθο περιεχόμενο;

source: Are you sure that you want to delete the following embedded content? Deleting embedded content removes it permanently and cannot be undone.
el: Είστε σίγουροι ότι θέλετε να διαγράψετε το ακόλουθο ενσωματωμένο περιεχόμενο; To ενσωματωμένο περιεχόμενο θα αφαιρεθεί μόνιμα και δε θα μπορεί να επαναφερθεί.

source: Are you sure that you want to delete the following link? Deleting a link removes it permanently and cannot be undone.
el: Είστε σίγουροι ότι θέλετε να διαγράψετε τον πιο κάτω σύνδεσμο; Η διαγραφή ενός συνδέσμου είναι μόνιμη και δε μπορεί να αναιρεθεί.

source: Are you sure that you want to delete this blog post? Deleting a blog post deletes it permanently and cannot be undone.
el: Είστε βέβαιοι ότι θέλετε να διαγράψετε αυτή την ανάρτηση από το blog; Η διαγραφή μιας ανάρτησης από το blog είναι μόνιμη και δε μπορεί να αναιρεθεί

source: Are you sure that you want to delete this cloud? Deleting a cloud deletes it permanently and cannot be undone.
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το cloud; Η διαγραφή cloud είναι μόνιμη και δεν μπορεί να αναιρεθεί.

source: Are you sure that you want to delete this cloudscape? Deleting a cloudscape deletes it permanently and cannot be undone.
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το cloudscape; Η διαγραφή ενός cloudscape είναιι μόνιμη και δε μπορεί να αναιρεθεί.

source: Are you sure you want to delete the section '!title'. This does not delete the clouds in that section or remove them from the cloudscape.
el: Είστε σίγουροι ότι θέλετε να διαγράψετε την κατηγορία '!title'; Σημειώνεται ότι τα clouds σε αυτή την κατηγορία δεν θα διαγραφούν ούτε θα αφαιρεθούν από το cloudscape.

source: At the moment you can just remove clouds from the cloudscape, but we plan to expand the functionality here in future.
el: Στο παρόν στάδιο μπορείτε μόνο να αφαιρείτε clouds από ένα cloudscape, αλλά σχεδιάζουμε να επεκτείνουμε τη λειτουργικότητα αυτή στο μέλλον.

source: Attribution
el: Αναφορά

source: Attribution link
el: Σύνδεσμος Αναφοράς

source: Attribution name
el: Αναφορά

source: Back to !name's profile
el: Επιστροφή στο προφίλ του/της !name

source: Back to cloudscape
el: Επιστροφή στο cloudscape

source: Back to user
el: Πίσω στο χρήστη

source: Background
el: Ερευνητικό Υπόβαθρο

source: Body
el: Κυρίως Μέρος

source: Browse the front page to get an idea of new Clouds and any new discussions around Clouds.
el: Ρίξτε μια ματιά στην οικοσελίδα για να πάρετε μια ιδέα για τα νέα Clouds και για τις νέες συζητήσεις γύρω από τα Clouds.

source: CAPTCHA image
el: CAPTCHA εικόνα

source: Can I have two accounts with the same password?
el: Μπορώ να έχω δύο λογαριασμούς με το ίδιο κωδικό πρόσβασης;

source: Can I restrict access/ add editors to my Clouds and Cloudscapes?
el: Μπορώ να περιορίσω την πρόσβαση/ να προσθέσω συντάκτες στα Clouds και Cloudscapes μου;

source: Change Password
el: Αλλαγή Κωδικού Πρόσβασης

source: Change password
el: Αλλαγή κωδικού πρόσβασης

source: Check the clouds from this cloudscape to add
el: Επιλέξτε τα clouds από αυτό το cloudscape που θέλετε να προσθέσετε

source: Click on Log in
el: Κάντε κλίκ στο κουμπί 'Σύνδεση'

source: Click on [link-pas]Forgotten Password[/link]
el: Κάντε κλίκ στο κουμπί [link-pas]Ξεχάσατε τον κωδικό σας[/link]

source: Click on the link
el: Κάντε κλίκ στον σύνδεσμο

source: Close your Cloudscape so that other people can't add Clouds to it
el: Να κλείσετε τα Cloudscape σας έτσι ώστε να μην μπορούν να προσθέτουν Clouds άλλα άτομα σε αυτό

source: Closed
el: Κλειστό για νέες προσθήκες

source: Cloud created
el: To Cloud δημιουργήθηκε

source: Cloud or Cloudscape?
el: Cloud ή Cloudscape;

source: Clouds and Cloudscapes can be tagged by pedagogy, discipline, tool and other and can be searched using these tags or via a search facility. You can also find relevant content by browsing All Clouds, All Cloudscapes or looking at the Clouds associated with individuals under their profile.
el: Στα Clouds και Cloudscapes μπορούν να τοποθετηθούν ετικέτες με βάση την παιδαγωγία που αφορούν, το γνωστικό τους πεδίο, το εργαλείο που αφορούν ή κάποιο άλλο παράγοντα. Μπορεί να γίνει αναζήτηση με βάση τις ετικέτες ή με την λειτουργία Αναζήτησης. Μπορείτε επίσης να βρείτε σχετικό περιεχόμενο με την προβολή όλων των Clouds και Cloudscapes ή με την προβολή των Clouds που ενδιαφέρουν άτομα τα οποία ακολουθείτε, τα οποία μπορείτε να βρείτε κάτω από το προφίλ κάθε ατόμου.

source: Clouds and Cloudscapes have different functionality.
el: Τα Clouds και τα Cloudscapes έχουν διαφορετική λειτουργικότητα.

source: Clouds can be aggregated into 'Cloudscapes' associated with a particular event, purpose or interest. For example you can have Cloudscapes associated with a conference aggregating Clouds about conference presentations or tools and resources referenced. A Cloudscape can be set up for a workshop where Clouds might include workshop resources, tools or activities. Cloudscapes can also be more general for example to stimulate debate about a particular teaching approach. Clouds can be associated with more than one Cloudscape.
el: Τα Clouds μπορούν να συγκεντρώνονται σε 'Cloudscapes' το οποία σχετίζονται με ένα συγκεκριμένο γεγονός, σκοπό ή ενδιαφέρον. Για παράδειγμα μπορείτε να έχετε ένα Cloudscapes σχετικό με ένα συνέδριο με την συγκέντρωση διαφόρων Clouds που αναφέρονται σε παρουσιάσεις του συνεδρίου ή εργαλεία και πηγές που αναφέρθηκαν στο συνέδριο. Ένα Cloudscape μπορεί επίσης να είναι πιο γενικό, για παράδειγμα να αποτελούν το έναυσμα συζητήσεων γύρω από μια συγκεκριμένη προσέγγιση Διδασκαλίας. Σημειώνετε ότι ένα Cloud μπορεί να συσχετιστεί με περισσότερα από ένα Cloudscape.

source: Clouds can be anything of relevance to learning and teaching
el: Ta Clouds μπορεί να είναι οτιδήποτε σχετικό με την εκμάθηση και τη διδασκαλία

source: Clouds can be anything of relevance to learning and teaching e.g. a description of a learning activity, a case study, a resource or tool, a summary of a presentation.
el: Clouds μπορούν να είναι ο,τιδήποτε σχετικό με την εκμάθηση και την διδασκαλία π.χ. περιγραφής μιας δραστηριότητας εκμάθησης, μιας μελέτης περίπτωσης, ενός πόρου ή ενός εργαλείου, περίληψη μιας παρουσίασης.

source: Clouds in this Cloudscape
el: Clouds σε αυτό το Cloudscape

source: Cloudscape picture edited
el: Η εικόνα του Cloudscape έχει τροποποιηθεί

source: Cloudscapes are collections of clouds about a certain topic.
el: Cloudscapes είναι συλλογές από clouds σχετικά με ένα συγκεκριμένο θέμα.

source: Cloudscapes can also be used to support workshops and all the tips and hints suggested for supporting conferences are also valid for supporting workshops.
el: Τα Cloudscapes μπορούν επίσης να χρησιμοποιηθούν για την υποστήριξη εργαστηρίων. Όλες οι συμβουλές και υποδείξεις που προτείνουμε για την υποστήριξη συνεδρίων ισχύουν επίσης για την υποστήριξη εργαστηρίων.

source: Cloudstream for !person
el: Cloudstream για τον/την!person

source: Cloudstream for !title
el: Cloudstream για !title

source: Cloudstream for the cloudscape !title
el: Cloudstream για το cloudscape !title

source: Cloudstream for this cloudscape
el: Cloudstream για αυτό το cloudscape

source: Cloudworks Terms and Conditions of Use
el: Όροι Χρήσης του Cloudworks

source: Cloudworks Vision Statement
el: Δήλωση Oράματος του Cloudworks

source: Cloudworks can notify you by e-mail when particular actions occur on the site.
el: Το Cloudworks μπορεί να σας ειδοποιεί με e-mail όταν συγκεκριμένες ενέργειες συμβαίνουν στον ιστοχώρο μας.

source: Cloudworks is being developed by the Institute of Educational Technology at The Open University. It is part of the !project-link and is funded by both JISC and The Open University.
el: Το Cloudworks αναπτύσσεται από το Ινστιτούτο Εκπαιδευτικής Τεχνολογίας του Ανοιχτού Πανεπιστημίου της Αγγλίας. nΑποτελεί μέρος του !project-link και χρηματοδοτείται από το JISC και το Ανοικτό Πανεπιστήμιο της Αγγλίας.

source: Cloudworks is not a repository - this means that it is not possible to upload files onto the site. We have done this for a number of reasons, not least because we recognise the issues associated with uploading documents to multiple places (such as editing and managing permissions).
el: Τα Cloudworks δεν είναι χώρος αποθήκευσης αρχείων - αυτό σημαίνει ότι δεν μπορείτε να αποθηκεύετε τα αρχεία σας πάνω στον ιστοχώρο του Cloudworks. Έχουμε ακολουθήσει αυτή την τακτική για πολλούς λόγους, ένας από τους οποίους είναι τα ζητήματα που μπορούν να προκύψουν από την ταυτόχρονη φόρτωση αρχείων σε πολλούς χώρους (για παράδειγμα θέματα επεξεργασίας και διαχείρησης δικαιωμάτων χρήσης)

source: Cloudworks: Public Cloudstream
el: Cloudworks: Δημόσιο Cloudstream

source: Comment
el: Σχόλια

source: Comments
el: Σχόλια

source: Complete your profile details - include a summary of your interests and link to relevant websites. Provide details of your twitter name, which will enable any tweets with your twitter name on to be aggregated under your profile and will provide a means for other users of Cloudworks to contact you via twitter.
el: Συμπληρώστε τις λεπτομέρειες του προφίλ σας - συμπεριλάβετε μια περίληψη των ενδιαφερόντων και συνδέσμους σε σχετικούς ιστοχώρους. Παρέχετε τις λεπτομέρειες του twitter ονόματος σας, το οποίο θα επιτρέψει σε οποιαδήποτε tweets με το twitter όνομα σας να μαζευτούν κάτω από το προφίλ σας και να παρέχεται ένα μέσο για τους άλλους χρήστες να έρθουν σε επαφή με εσάς μέσω του twitter.

source: Confirm New Password
el: Επιβεβαίωση νέου κωδικού πρόσβασης

source: Confirm Password
el: Επιβεβαίωση Κωδικού Πρόσβασης

source: Content
el: Περιεχόμενο

source: Continue
el: Συνέχεια

source: Contribute to the discussion
el: Συμμετοχή στη συζήτηση

source: Copyright !date !organization
el: Πνευματικά δικαιώματα !date !organization

source: Country
el: Χώρα

source: Create Cloud
el: Δημιουργία Cloud

source: Create Cloud in this Cloudscape
el: Δημιουργία Cloud στο Cloudscape

source: Create Clouds on good learning and teaching ideas you have created or that you have seen or experienced. Keep your Clouds short and succinct; include relevant links to further information. Consider depositing further information in an Open Educational Resource repository such as Connexions. Tag appropriately in terms of subject, pedagogy and tools.
el: Δημιουργία Clouds για καλές ιδέες εκμάθησης και διδασκαλίας που έχετε δημιουργήσει ή που έχετε δει ή βιώσει. Διατηρήστε τα Clouds σας σύντομα και περιεκτικά; συμπεριλάβετε σχετικούς συνδέσμους για περαιτέρω πληροφορίες. Μπορείτε επίσης να καταθέσετε επιπλέον πληροφορίες σε κάποια Ανοικτή Αποθήκη Εκπαιδευτικών πηγών όπως το Connexions. Τοποθετήστε τις κατάλληλες ετικέτες σε σχέση με το θέμα, την παιδαγωγική προσέγγιση και τα εργαλεία.

source: Create Cloudscape
el: Δημιουργία Cloudscape

source: Create a Cloudscape
el: Δημιουργία Cloudscape

source: Create a comment item
el: Δημιουργία σχολίου

source: Create comment
el: Δημιουργία σχολίου

source: Create news
el: Δημιουργία Είδησης

source: Cropped picture
el: Αποκομμένη εικόνα

source: Cropped version of picture
el: Μικρότερη εκδοχή της εικόνας

source: Current and Upcoming Events
el: Τρέχοντα και Προσεχή γεγονότα

source: Deadline
el: Προθεσμία

source: Deadline: !date
el: Προθεσμία: !date

source: Delete
el: Διαγραφή

source: Delete Cloud
el: Διαγραφή Cloud

source: Delete Cloudscape
el: Διαγραφή Cloudscape

source: Delete Embedded Content
el: Διαγραφή Ενσωματωμένου Περιεχομένου

source: Delete Link
el: Διαγραφή Link

source: Delete Reference
el: Διαγραφή αναφοράς

source: Delete Section
el: Διαγραφή Κατηγορίας

source: Delete blog post
el: Διαγραφή ανάρτησης από το blog

source: Delete comment
el: Διαγραφή σχολίου

source: Delete content
el: Διαγραφή περιεχομένου

source: Delete embedded content from the cloud !title
el: Διαγραφή ενσωματωμένου περιεχομενου από το cloud !title

source: Delete link from the cloud !title
el: Διαγραφή συνδέσμου από το cloud !title

source: Delete news
el: Διαγραφή είδησης

source: Delete section
el: Διαγραφή κατηγορίας

source: Delete section '!title'
el: Διαγραφή κατηγορίας '!title'

source: Delete the blog post !title
el: Διαγραφή της ανάρτησης !title

source: Delete the cloud !title
el: Διαγραφή του cloud !title

source: Delete the cloudscape !title
el: Διαγραφή του cloudscape !title

source: Delete this Cloud
el: Διαγραφή του Cloud

source: Delete this Cloudscape
el: Διαγραφή αυτού του Cloudscape

source: Delete this comment
el: Διαγραφή σχολίου

source: Deletion successful
el: Διαγραφή επιτυχής

source: Department
el: Τμήμα

source: Description
el: Περιγραφή

source: Description !required!
el: Η περιγραφή !required!

source: Display my e-mail address on my profile
el: Εμφάνιση της διεύθυνσης ηλεκτρονικού ταχυδρομείου μου στο προφίλ μου

source: E-mail
el: Ηλεκτρονικό ταχυδρομείο

source: E-mail address
el: Διεύθυνση email

source: Edit
el: Επεξεργασία

source: Edit Cloud
el: Επεξεργασία Cloud

source: Edit Cloud
el: Επεξεργασία Cloud

source: Edit Cloudscape
el: Επεξεργασία Cloudscape

source: Edit Comment
el: Επεξεργασία σχολίου

source: Edit Content
el: Επεξεργασία περιεχομένου

source: Edit Embedded Content
el: Επεξεργασία Ενσωματωμένου Περιεχομένου

source: Edit Link
el: Επεγεργασία Link

source: Edit Picture
el: Επεξεργασία εικόνας

source: Edit Profile
el: Επεξεργασία προφίλ

source: Edit comment
el: Επεξεργασία σχολίου

source: Edit e-mail preferences
el: Επεξεργασία προτιμήσεων e-mail

source: Edit embedded content
el: Επεξεργασία ενσωματωμένου περιεχομένου

source: Edit embedded content for the cloud !title
el: Επεξεργασία ενσωματωμένου περιεχομένου για το cloud !title

source: Edit link
el: Επεξεργασία συνδέσμου

source: Edit link for the cloud !title
el: Επεξεργσία συνδέσμου για το cloud !title

source: Edit news
el: Επεξεργασία Είδησης

source: Edit picture
el: Επεξεργασία εικόνας

source: Edit the Cloudscape Picture
el: Επεξεργασία εικόνας Cloudscape

source: Edit this Cloudscape
el: Επεξεργασία του Cloudscape

source: Edit this Comment
el: Επεξεργασία αυτού του σχόλιου

source: Edit this News Item
el: Επεξεργασία αυτής της Είδησης

source: Edit this content
el: Επεξεργασία αυτού του περιεχομένου

source: Edited !date
el: Τροποποιήθηκε !date

source: Email
el: Ηλεκτρονικό ταχυδρομείο

source: Embed a video or image
el: Ενσωματώστε ένα βίντεο ή μια εικόνα

source: Embedded Content
el: Ενσωματωμένο Περιεχόμενο

source: Engage in a conversation, comment on other people's entries and Clouds.
el: Συμμετέχετε σε συνομιλίες, σχολίάστε καταχωρήσεις και Clouds άλλων ατόμων.

source: Enrich Clouds using the html functionality available in the editor. Hyperlink to relevant information. Include illustrative images. Embed slideshare presentations, YouTube videos or flickr images. Aggregate related tweets or blogs.
el: Εμπλουτίστε τα Clouds χρησιμοποιώντας τη λειτουργία HTML που είναι διαθέσιμη στον επεξεργαστή κειμένου. Προσθέστε συνδέσμους με σχετικές πληροφορίες. Συμπεριλάβετε επεξηγηματικές εικόνες. Ενσωματώστε παρουσιάσεις από το Slideshare, βίντεο από το YouTube ή εικόνες από το flickr. Συγκεντρώστε τα σχετικά tweets ή blogs.
