Repository: IET-OU/cloudengine
Catalog: system/application/language/*/LC_MESSAGES/application.po
Languages: el

source: Ensure a low barrier to entry for new contributions. We believe that one of the main barriers to contribution to other repositories is the level of detail and metadata required, cumbersome quality control processes and issues around ownership.
el: Διασφαλίζοντας την εύκολη διαδικασία καταχωρήσεων με την απαίτηση όσο το δυνατό λιγότερων πληροφοριών κατά την καταχώρηση. Πιστεύουμε ότι ένα από τα κύρια εμπόδια που έχουν οι χρήστες για να συμβάλουν σε άλλες διαδικτυακές αποθήκες πληροφοριών είναι το επίπεδο λεπτομέρειας και metadata που απαιτούνται, καθώς και οι φορτικές διαδικασίες διασφάλισης ποιότητας και τα προβλήματα γύρω από το θέμα της ιδιοκτησίας.

source: Ensure that the site acts as a conduit; by aggregating content from related sites and through APIs, so that users can access the data on the site from elsewhere. This will ensure maximum uptake and repurposing of the content from the site and enable people to use it in innovative ways we may not have anticipated.
el: Εξασφαλίζοντας ότι ο ιστοχώρος ενεργεί ως αγωγός; με τη συγκέντρωση του περιεχομένου από σχετικούς ιστοχώρους και μέσω APIs, έτσι ώστε οι χρήστες να μπορούν να έχουν πρόσβαση στα δεδομένα του ιστοχώρου από άλλους χώρους. Αυτό θα εξασφαλίσει το μέγιστο βαθμό ενημέρωσης λήψης και χρησιμοποίησης περιεχομένου του ιστοχώρου και θα επιτρέψει στους ανθρώπους να το χρησιμοποιήσουν με καινοτόμους τρόπους που μπορεί να μην είχαμε καν προβλέψει.

source: Error: search is not working.
el: Σφάλμα: η αναζήτηση δεν λειτουργεί.

source: Event information
el: Πληροφορίες Συμβάντος

source: Events
el: Γεγονότα

source: Extra content
el: Επιπρόσθετο περιεχόμενο

source: FAQ - Using the Site
el: Συνήθεις ερωτήσεις - Χρήση του ιστοχώρου

source: Featured Cloudscapes
el: Επίκαιρα Cloudscapes

source: File
el: Αρχείο

source: File Uploads
el: Φόρτωση Αρχείων

source: Find People
el: Αναζήτηση ατόμων

source: Find others by name or institution.
el: Αναζητήστε άτομα με βάση το όνομα ή τον οργανισμό στον οποίο ανήκουν.

source: Find out more
el: Μάθετε περισσότερα

source: Follow Cloudscapes and people you are interested in, these will be listed on your profile and give others an idea of your interests.
el: Γίνεται follower σε Cloudscapes και άτομα που σας ενδιαφέρουν, τα οποία θα απαρριθμούνται στο προφίλ σας και θα δώσουν στους άλλους μια ιδέα γύρω από τα ενδιαφέροντά σας.

source: Followers for the cloudscape !title
el: Followers του cloudscape !title

source: For example
el: Για παράδειγμα

source: Forgot your password?
el: Ξεχάσατε τον κωδικό σας;

source: Forgotten Password
el: Ξεχάσατε τον Κωδικό σας;

source: Forgotten password
el: Ξεχάσατε τον κωδικό σας:

source: From the drop-down box choose 'Your Profile'
el: Από το drop-down πλαίσιο επιλέξτε 'Το Προφίλ μου'

source: Full Name
el: Ονοματεπώνυμο

source: Full name
el: Ονοματεπώνυμο

source: Full name !required!
el: To oνοματεπώνυμο !required!

source: Get creating Clouds! These will also be listed on your profile.
el: Δημιουργήστε δικά σας Clouds! Φυσικά και τα δικά σας Clouds θα παρουσιάζονται στο προφίλ σας.

source: Give one or more users full admin rights of your Cloudscape
el: Να δώσετε σε έναν ή σε περισσότερους χρήστες πλήρη δικαιώματα διαχείρισης του Cloudscape σας

source: Give the site a people-orientated focus. It is conversation and shared experiences that will draw people to contribute to the site and make it sustainable. Finding the right person to talk to is often as important as finding the right resource.
el: Δίνοντας στον ιστοχώρο μια ανθρωποκεντρική εστίαση. Η συζήτηση και οι κοινές εμπειρίες είναι αυτά που θα προσελκύσουν τον κόαμο να συνεισφέρουν στον ιστοχώρο αυτό και να τον καταστήσουν βιώσιμο. Η εύρεση του σωστού προσώπου για να μιλήσουμε είναι συχνά σημαντικότερη από την εύρεση της σωστής πηγής.

source: Go to all clouds
el: Προβολή όλων των clouds

source: Go to all cloudscapes
el: Προβολή όλων των cloudscapes

source: Go to the blog post
el: Προβολή της καταχώρησης

source: Go to the cloud
el: Προβολή του cloud

source: Go to your profile
el: Προβολή του προφίλ μου

source: Got extra information or live blog notes about this cloud? [link-add]Add them here![/link]
el: Έχετε επιπρόσθετο περιεχόμενο ή ζωντανά σχόλια σε blog σχετικά με αυτό το cloud; [link-add]Προσθέστε τα εδώ![/link]

source: Here is your new login information:
el: Εδώ είναι οι νέες πληροφορίες σύνδεσης σας:

source: Home
el: Οικοσελίδα

source: Home page
el: Οικοσελίδα

source: Homepage
el: Αρχική

source: How can I add a deadline?
el: Πώς μπορώ να προσθέσω μια προθεσμία;

source: How can I change my email notifications?
el: Πώς μπορώ να αλλάξω τις ειδοποιήσεις που λαμβάνω μέσω ηλεκτρονικού ταχυδρομείου;

source: I didn't receive my registration email - what should I do?
el: Δεν έχω λάβει το email με την εγγραφή μου - τι πρέπει να κάνω;

source: I've lost my password - what should I do?
el: Έχω χάσει τον κωδικό πρόσβασής μου - τι πρέπει να κάνω;

source: If this cloud is for a call of papers or for a call for book chapters, please enter the deadline here for it to appear in the diary.
el: Αν αυτό το cloud αφορά κάποια Προκήρυξη για Άρθρα ή για κεφάλαια βιβλίων, παρακαλείστε όπως εισάγετε την ημερομηνία λήξης της προθεσμίας εδώ, έτσι ώστε να εμφανίζεται στο ημερολόγιο.

source: If you are finding that your posts are constantly being sent for moderation then please contact us !email-link!.
el: Εάν διαπιστώαετε ότι οι καταχωρήσεις σας στέλνονται συνεχώς για επιτήρηση παρακαλώ επικοινωνήστε μαζί μας !email-link!.

source: If you are interested in your cloudscape being featured on the home page, please make your image as close to !dimensions pixels as possible.
el: Αν επιθυμείτε τα cloudscape σας να εμφανίζονται στην αρχική σελίδα, παρακαλώ κρατήστε τις διαστάσεις της εικόνας σας όσο πιο κοντά στα !dimensions pixels

source: If you did not make this request please ignore this e-mail.
el: Εαν δεν κάνατε εσείς αυτή την αίτηση παρακαλούμε όπως αγνοήσετε αυτό το e-mail.

source: If you have further questions, then drop us an e-mail at !email-link!
el: Εάν έχετε περαιτέρω ερωτήσεις μπορείτε να επικοινωνήσετε μαζί μας στην διεύθυνση ταχυδρομείου !email-link!

source: If you have lost or forgotten your password, the site can quickly send you a new one.
el: Εάν έχετε χάσει ή ξεχάσει τον κωδικό σας, το Cloudworks μπορεί γρήγορα να σας στείλει ένα νέο κωδικό.

source: If you want to use an image from a site like !link, please check the owner of the image gives permission for re-use, and provide attribution if required.
el: Εάν θέλετε να χρησιμοποιήσετε μια εικόνα από ένα site όπως το !link, παρακαλώ σιγουρευτείτε ότι ο ιδιοκτήτης της εικόνας δίνει την άδεια για επαναχριημοποίηση της εικόνας, και προσθέστε αναφορά στην πηγή σας εάν απαιτείται.

source: If you would like the Cloudscape to be featured on the front page, send us the URL and a 240x180 image. We'll need permission from the copyright holder to put the image on the site too.
el: Αν επιθυμείτε τo cloudscape να εμφανίζεται στην αρχική σελίδα, παρακαλώ στείλτε μας το URL και μια εικόνα 240x180. Θα χρειαστούμε επίσης την άδεια του κατόχου των πνευματικών δικαιωμάτων για να αναρτήσουμε την εικόνα στο Cloudworks.

source: Image File
el: Αρχείο εικόνας

source: Image by !person
el: Εικόνα από !πρόσωπο

source: In Cloudscapes
el: Στα Cloudscapes

source: Include a short clear description of the conference in the Cloudscape with a link to the conference website.
el: Συμπεριλάβετε μια σύντομη και σαφή περιγραφή του συνεδρίου στο Cloudscape με ένα σύνδεσμο στην ιστοσελίδα του συνεδρίου.

source: Incorporate a dynamic twitter stream, blog aggregator, flickr stream using the agreed conference tag.
el: Ενσωματώστε ένα δυναμικό twitter stream, blog aggregator, flickr stream, χρησιμοποιώντας τη συμφωνηθείσα ετικέτα (hash tag) του συνεδρίου.

source: Institution
el: Οργανισμός

source: Institution !required
el: Οργανισμός !required

source: Institutions
el: Ιδρύματα

source: Instructions for resetting your password have just been emailed to you.
el: Οδηγίες για επαναπροσδιορισμό του κωδικού σας για πρόσβαση στο Cloudworks έχουν αποσταλεί στο ηλεκτρονικό σας ταχυδρομείο.

source: Introduction
el: Εισαγωγή

source: It is possible to upload a picture to a Cloudscape (it is not yet possible to do this in a Cloud see [link-c2522]'Sharing pictures, videos, case studies and ideas through links and embeds'[/link]) but the following restrictions apply:
el: Μπορείτε να φορτώσετε μια εικόνα σε ένα Cloudscape (δεν είναι ακόμη δυνατό να γίνει αυτό σε ένα Cloud. Δείτε τον οδηγό [link-c2522]'Πώς να μοιράζεστε εικόνες, βίντεο, μελέτες περίπτωσης και ιδέες μέσω συνδέσμων και ενσωματωμένου περιεχομένου'[/link]), αλλά εφαρμόζονται οι ακόλουθοι περιορισμοί:

source: It is worth noting that you can't do this in Microsoft Paint.
el: Αξίζει να σημειωθεί ότι αυτό δεν μπορεί να γίνει στο Microsoft Paint.

source: Items tagged !tag
el: Αντικείμενα με την ετικέτα !tag

source: JPG, GIF, or PNG formats.
el: JPG, GIF, ή PNG τύποι εικόνας

source: Join !site-name!
el: Γίνετε μέλος του !site-name!

source: Latest comments
el: Τελευταία σχόλια

source: Link
el: Σύνδεσμος

source: Links
el: Συνδέσμοι

source: Live blog sessions and include as Clouds in the conference Cloudscape, keep entries short with succinct summaries, provide links to further information.
el: Δημιουργία ζωντανών συζητήσεων σε blog και προσθήκη τους σαν Clouds κάτω από το Cloudscape του συνεδρίου. Προσπαθήστε να κρατήσετε σύντομες τις καταχωρήσεις σας και να έχετε συνοπτικές περιλήψεις, καθώς επίσης και να παρέχετε συνδέσμους για περαιτέρω πληροφορίες.

source: Live blog workshop sessions such as plenary discussions and feedback sessions.
el: Δημιουργία ζωντανών εργαστηρίων σε blog όπως συζητήσεις με όλα τα μέλη και συζητήσεις για ανατροφοδότηση.

source: Load
el: Φόρτωση

source: Location
el: Τοποθεσία

source: Log in
el: Σύνδεση

source: Log-in and click on the red tab with your name on.
el: Συνδεθείτε και κάντε κλίκ στην κόκκινη ετικέτα με το όνομά σας.

source: Login
el: Σύνδεση

source: Make all content contributed to the site publicly accessible.
el: Περέχοντας στο κοινό πρόσβαση σε όλο το περιεχόμενο του ιστοχώρου.

source: Make cloudscape closed
el: Κλείσιμο του cloudscape για νέες προσθήκες

source: Make cloudscape open
el: Άνοιγμα του cloudscape για νέες προσθήκες

source: Manage Cloudscape Permissions
el: Διαχείριση Πρόσβασης στο Cloudscape

source: Manage clouds
el: Διαχείριση clouds

source: Manage clouds for the cloudscape !title
el: Διαχείρηση clouds για το cloudscape !title

source: Manage sections
el: Διαχείριση κατηγοριών

source: Maximum file-size of !sizeKB.
el: Μέγιστο μέγεθος αρχείου από !sizeKB.

source: Maximum size of !sizeKB.
el: Μέγιστο μέγεθος !sizeKB.

source: More
el: Περισσότερα

source: Move to comment
el: Μετακίνηση στα σχόλια

source: Move to content
el: Μεταφορά στο περιεχόμενο

source: My Cloudscape picture is too big. How can I reduce its size?
el: Η εικόνα του Cloudscape μου είναι πολύ μεγάλη. Πώς μπορώ να μειώσει το μέγεθός της;

source: Name !required
el: Το όνομα !required

source: New Clouds
el: Νέα Clouds

source: New Cloudscapes
el: Νέα Cloudscapes

source: New Password
el: Νέος κωδικός πρόσβασης

source: New section name
el: Νέο όνομα Κατηγορίας

source: No admins set
el: Δεν υπάρχουν ακόμη διαχειριστές

source: No clouds in this section.
el: Δεν υπάρχουν clouds σε αυτή την Κατηγορία

source: No clouds yet
el: Δεν υπάρχουν ακόμη clouds

source: No cloudscapes
el: Δεν υπάρχουν cloudscapes

source: No cloudscapes yet
el: Δεν υπάρχουν ακόμη cloudscapes

source: No events
el: Δεν υπάρχουν γεγονότα

source: No events in this cloudstream.
el: Δεν υπάρχουν γεγονότα σε αυτό το cloudstream.

source: No followers yet
el: Δεν υπάρχουν followers

source: No posters set
el: Δεν υπάρχουν ακόμη συντάκτες

source: No results found for !item
el: Δεν βρέθηκαν αποτελέσματα σχετικά με !item

source: No results found for !search
el: Δεν βρέθηκαν αποτελέσματα για !search

source: No results found for '!search'
el: Δεν βρέθηκαν αποτελέσματα για '!search'

source: No sections yet
el: Δεν υπάρχουν κατηγορίες ακόμα

source: No tweets
el: Δεν υπάρχουν tweets

source: No users yet
el: Δεν υπάρχουν ακόμη χρήστες

source: Not following any cloudscapes yet
el: Δεν ενημερώνεστε για κανένα cloudscape ακόμη

source: Not following anybody yet
el: Δεν ενημερώνεται για κανέναν ακόμη

source: OULDI project leader
el: Επικεφαλής έργου OULDI

source: Off
el: Απενεργοποίηση

source: Old Password
el: Παλιός κωδικός πρόσβασης

source: On
el: Ενεργοποίηση

source: Only alpha characters, digits, underline or dash characters allowed.
el: Επιτρέπονται μόνο γράμματα,αριθμοί, παύλα ή χαμηλή παύλα.

source: Open
el: Ανοικτό

source: Owner
el: Ιδιοκτήτης

source: Password
el: Κωδικός πρόσβασης

source: Password Reset
el: Επαναπροσδιορισμός κωδικού πρόσβασης

source: Password Reset Failed
el: Ο επαναπροσδιορισμός του κωδικού πρόσβασης απέτυχε

source: Password changed
el: Ο κωδικός πρόσβασης τροποποιήθηκε

source: Password incorrect
el: Λανθασμένος κωδικός πρόσβασης

source: Past Deadlines
el: Περασμένες Προθεσμίες

source: Past Events
el: Προηγούμενα γεγονότα

source: Past deadlines
el: Περασμένες προθεσμίες

source: Past events
el: Περασμένα γεγονότα

source: People
el: Άτομα

source: Permissions
el: Δικαιώματα πρόσβασης

source: Permissions for the cloudscape !title
el: Δικαιώματα για το cloudscape !title

source: Photos: !site_link
el: Φωτογραφίες: !site_link

source: Please [link-log]log in[/link] to post a comment. [link-join]Register here[/link] if you haven't signed up yet.
el: Παρακαλώ [link-log]συνδεθείτε[/link] για να μπορείτε να προσθέσετε σχόλια. Εάν δεν είστε ήδη μέλος μπορείτε να [link-join]εγγραφείτε εδώ[/link].

source: Please change this password as soon as possible by logging in with this new information and then going to the following link:
el: Παρακαλείστε να αλλάξετε αυτόν τον κωδικό πρόσβασης το συντομότερο δυνατό, με το να συνδεθείτε χρησιμοποιώντας τα νέα σας στοιχεία πρόσβασης και έπειτα πηγαίνοντας στο ακόλουθο σύνδεσμο:

source: Please enter a start date as well as an end date.
el: Παρακαλώ εισάγετε την ημερομηνία έναρξης και την ημερομηνία λήξης.

source: Please enter a start date that is before the end date.
el: Παρακαλώ εισάγετε ημερομηνία έναρξης που να είναι πριν από την ημερομηνία λήξης.

source: Please make sure you have permission to use the photo you upload.
el: Παρακαλούμε βεβαιωθείτε ότι έχετε την άδεια να χρησιμοποιήσετε τη φωτογραφία που θέλετε να ανεβάσετε.

source: Please retype the letters in the image below
el: Παρακαλώ δακτυλογραφήστε ξανά τα γράμματα στην εικόνα πιο κάτω

source: Please use the [link-ref]Harvard system of referencing[/link] if possible.
el: Παρακαλούμε όπως χρησιμοποιείτε το [link-ref]Σύστημα Αναφοράς του Harvard[/link] όπου είναι δυνατόν.

source: Popular Tags
el: Δημοφιλή Ετικέτες

source: Post a comment
el: Προσθήκη σχολίου

source: Post comment
el: Δημοσίευση σχόλιου

source: Posted by !person on !date
el: Τοποθετήθηκε από !person στις !date

source: Posters
el: Συντάκτες

source: Preferred language
el: Γλώσσα προτίμησης

source: Promote the conference Cloudscape to delegates, via Twitter etc and invite them to follow the Cloudscape.
el: Προωθήστε το Cloudscape του συνεδρίου στους αντιπροσώπους μέσω του Twitter κ.λπ. και προσκαλέστε τους να γίνουν followers το Cloudscape.

source: Public Cloudstream
el: Δημόσιο Cloudstream

source: Read the [link-ai]introduction to Cloudworks[/link] or watch the video:
el: Διαβάστε την [link-ai]Εισαγωγή στο Cloudworks[/link] ή παρακολουθήστε το βίντεο:

source: Reference
el: Αναφορά

source: References
el: Αναφορές

source: Register
el: Εγγραφή

source: Remove as admin
el: Αφαίρεση διαχειριστή

source: Remove as poster
el: Αφαίρεση ως συντάκτη

source: Removing a cloud just removes it from the cloudscape. It does not delete the cloud.
el: Αφαίρεση ενός cloud το αφαιρεί απλά από το cloudscape. Το cloud δεν διαγράφεται εξ'ολοκλήρου.

source: Rename '!title'
el: Μετονομασία '!title'

source: Rename section
el: Μετονομασία κατηγορίας

source: Results for !item
el: Αποτελέσματα για !item

source: Results for !search
el: Αποτελέσματα για !search

source: Save
el: Αποθήκευση

source: Save Cloud
el: Αποθήκευση Cloud

source: Save Cloudscape
el: Αποθήκευση Cloudscape

source: Save comment
el: Αποθήκευση σχολίου

source: Save content
el: Αποθήκευση περιεχομένου

source: Search
el: Αναζήτηση

source: Search Results
el: Αποτελέσματα Αναζήτησης

source: Search cloudscapes
el: Αναζήτηση στα cloudscapes

source: Search the site by browsing the tag Cloud, 'All Clouds' list, 'All Cloudscapes' list or via individual profiles or search using key words.
el: Αναζητήστε πληροφορίες στον ιστοχώρο ψάχνοντας στην λίστα από τις ετικέτες, την λίστα 'Όλα τα Clouds', 'Όλα τα Cloudscapes', μέσω των προφίλ διαφόρων ατόμων ή με την αναζήτηση λέξεων-κλειδιών.

source: Search users
el: Αναζήτηση χρηστών

source: Section name
el: Όνομα Κατηγορίας

source: Section where clouds will be added
el: Κατηγορία όπου θα προστεθούν τα clouds

source: Security Code
el: Κωδικός Ασφαλείας

source: Security code
el: Κωδικός ασφαλείας

source: Send
el: Αποστολή

source: Set up RSS feeds for Cloudscapes or people you are interested in keeping up to date with.
el: Ρυθμίστε τα RSS feeds για Cloudscapes ή άτομα για τα οποία θέλετε να ενημερώνεστε.

source: Set up a Cloudscape to aggregate related innovative Clouds - for example those relating to mobile learning, problem-based learning, learning a language.
el: Δημιουργία Cloudscape για συγκέντρωση συσχετιζόμενων καινοτόμων Clouds - παραδείγματος χάριν συγκέντρωση των Clouds που σχετίζονται με mobile learning (μάθηση με χρήση κινητών συσκευών), μάθηση βασισμένη στη επίλυση προβλημάτων, εκμάθηση μιας γλώσσας.

source: Set up a Cloudscape to support a special interest group and input Clouds of relevant resources. For example Cloudscapes can be set up for particular cohorts of students, enabling them to share good learning resources, and discuss learning strategies.
el: Δημιουργία ενός Cloudscape για την υποστήριξη μιας ομάδας ενδιαφέροντος και εισάγωγη Clouds με σχετικές πηγές. Για παράδειγμα ένα Cloudscape μπορεί να δημιουργηθεί είναι για συγκεκριμένες ομάδες μαθητών, παρέχοντας τους την δυνατότητα να μοιράζονται ενδιαφέρουσες πηγές μάθησης και να συζητούν στρατηγικές μάθησης.

source: Set up discussion Clouds that can be used as a basis for group activities during the workshop. Include a brief outline of the activity you want delegates to take part in and any associated questions you want them to address. Get them working in groups and entering their discussions as comments on the discussion Cloud. Encourage them to scan what other groups are entering.
el: Η ρύθμιση συζήτησης στα Clouds μπορεί να χρησιμοποιηθεί ως βάση για τις δραστηριότητες της ομάδας κατά τη διάρκεια του εργαστηρίου. Συμπεριλάβετε μια σύντομη περιγραφή της δραστηριότητας των αντιπροσώπων που θέλετε να λάβουν μέρος και κάθε συναφείς ερωτήσεις που θέλετε να αποστείλλετε. Πάρτε αυτούς που εργάζονται σε ομάδες και εισέρχονται σε συζητήσεις με παρατηρήσεις σχετικά με τη συζήτηση στο Cloud. Να τους ενθαρρύνετε να ανιχνεύσουν τι άλλες ομάδες εισέρχονται.

source: Show all
el: Προβολή όλων

source: Sign out
el: Αποσύνδεση

source: Sign up
el: Εγγραφή

source: Summary
el: Περίληψη

source: Support
el: Υποστήριξη

source: Tags
el: Ετικέτες

source: Tags !note
el: Ετικέτες !note

source: Target people most likely to contribute to a public site, as well as consume content from it. This will include those with support roles in institutions (such as learning technologists, instructional designers, educational developers), as well as learning and teaching innovators and 'e-learning champions'.
el: Στοχεύοντας σε άτομα που είναι πιθανότερο να συμβάλουν σε ένα δημόσιο ιστοχώρο, καθώς επίσης και να αντλήσουν από το περιεχόμενό του. Σε αυτά τα άτομα περιλαμβάνονται τα άτομα με υποστηρικτικό ρόλο στους οργανισμούς (όπως οι τεχνολόγοι της μάθησης, οι εκπαιδευτικοί σχεδιαστές (instructional designers), ερευνητές για ανάπτυξη της εκπαίδευσης), καθώς επίσης και τους καινοτόμους σε μάθηση και διδασκαλία και τους πρωτοπόρους στο e-learning.

source: Text
el: Κείμενο

source: Thank You!
el: Σας ευχαριστούμε!

source: Thank you to the Cloudworks critical friends: !friends and !friends-last and also to the other current and past members of the OULDI project: !team and !team-last for their comments and contributions.
el: Εκφράζουμε τις ευχαριστίες μας για τους φίλους του Cloudworks που μας βοήθησαν με την κριτική τους φίλοι: !friends και !friends-last καθώς επίσης και τα υφιστάμενα και προηγούμενα μέλη του έργου OULDI: !team και !team-last για τα σχόλια και την συνεισφορά τους.

source: The !field-name field can not exceed !count characters in length.
el: Το πεδίο !field-name δεν πρέπει να υπερβαίνει τους !count χαρακτήρες.

source: The !field-name field has an error
el: Το πεδίο !field-name περιέχει λάθος

source: The !field-name field is required.
el: Το πεδίο !field-name είναι απαραίτητο.

source: The !field-name field must be at least !count characters in length.
el: Το πεδίο !field-name πρέπει να έχει τουλάχιστον !count χαρακτήρες.

source: The !field-name field must contain a valid URL.
el: Το πεδίο !field-name πρέπει να περιέχει μια έγκυρη διεύθυνση URL.

source: The !field-name field must contain a valid email address
el: Το πεδίο !field-name πρέπει να περιέχει μια έγκυρη διεύθυνση ηλεκτρονικού ταχυδρομείου

source: The !field-name field must have a value.
el: Το πεδίο !field-name δεν μπορεί να είναι κενό.

source: The !field-name is invalid:
el: Το !field-name είναι άκυρο:

source: The Cloudworks Team
el: Η ομάδα του Cloudworks

source: The Cloudworks site is open, which means anyone can search for and view everything on the site. However, it is possible to manage permissions to Cloudscapes you have set up. By clicking on <em>'permissions'</em>on the right hand side of your Cloudscape page you can:
el: Ο ιστοχώρος του Cloudworks είναι ανοιχτός, που σημαίνει πως ο καθένας μπορεί να αναζητήσει και να δει τα πάντα που υπάρχουν στον ιστοχώρο. Ωστόσο, μπορείτε να διαχειριστείτε τα δικαιώματα για τα Cloudscapes που έχετε δημιουργήσει εσείς. Κάνοντας κλικ στο κουμπί <em>'Δικαιώματα'</em> στη δεξιά πλευρά του Cloudscape σας, μπορείτε:

source: The URL specified has already been added as a link to this cloud
el: The URL που καθορίσατε έχει ήδη προστεθεί σαν σύνδεσμος σε αυτό το cloud

source: The URL you have specified uses a URL shortener. Please give the original URL instead since URLs from URL shorteners may not exist forever.
el: Το URL που δώσατε χρησιμοποιεί ένα URL shortener. Παρακαλώ αντικαταστήστε το με το αρχικό URL της ιστοσελίδας, αφού τα συντομευμένα URL μπορεί να μην ισχύουν για πάντα.
