Repository: IET-OU/cloudengine
Catalog: system/application/language/*/LC_MESSAGES/application.po
Languages: el

source: The front page shows a rolling list of new Clouds added to the site on the right hand side, features Cloudscapes are presented in the middle panel and a list of Clouds that have recently had comments added to them appear on the left hand side. You can get a list of all the Clouds in the site by clicking on 'All Clouds'. A title and brief summary for each Cloud is provided. Click on the link to get further details. Clicking on the 'All Cloudscapes' link lists all the Cloudscapes in the site, as with individual Clouds a brief description of each Cloudscape is provided. Clicking on a particular Cloudscape will take you into it and will show all the Clouds associated with that Cloudscape.
el: Η πρώτη σελίδα εμφανίζει ένα κυλιόμενο κατάλογο των νέων Clouds που προστέθηκαν στον ιστοχώρο στη δεξιά πλευρά. Στο κεντρικό πλαίσιο παρουσιάζεται μια λίστα με Featured Cloudscapes και στα αριστερά εμφανίζεται η λίστα από τα Clouds στα οποία έχουν πρόσφατα προστεθεί νέα σχόλια. Μπορείτε να δείτε μια λίστα με όλα τα Clouds στον ιστοχώρο κάνοντας κλικ στο 'Όλα τα Clouds'. Για κάθε Cloud παρέχεται ο τίτλος του και μια σύντομη περίληψη. Κάντε κλικ στον σύνδεσμο για να πάρετε περισσότερες λεπτομέρειες. Κάνοντας κλικ στην επιλογή 'Όλα τα Cloudscapes' μπορείτε να δείτε μια λίστα με όλα τα Cloudscapes στον ιστοχώρο. Όπως και για τα Clouds παρέχεται μια σύντομη περιγραφή για κάθε Cloudscape. Κάνοντας κλικ σε ένα από τα Cloudscape θα μεταφερθείτε σε αυτό και θα δείτε όλα τα Clouds που συνδέονται με το συγκεκριμένο Cloudscape.

source: The graphic design of the Cloudworks site was done by !link.
el: Ο γραφικός σχεδιασμός του ιστοχώρου του Cloudworks έγινε από !link

source: The image must be landscape not portrait.
el: Η εικόνα πρέπει να είναι landscape, όχι portrait.

source: The page you requested was not found.
el: Η σελίδα που ζητήσατε δε βρέθηκε.

source: The password you entered was incorrect.
el: Ο κωδικός πρόσβασης που εισάγατε είναι λανθασμένος

source: The site is only supported on a best effort basis and during UK working hours, so please don't rely on it as a replacement for a conference website. We also usually perform upgrades on Thursday mornings so there is sometimes some short downtime then.
el: Ο ιστοχώρος αυτός υποστηρίζεται με τον καλύτερο δυνατό τρόπο κατά την διάρκεια των ωρών εργασίας του Ηνωμένου Βασιλείου, χωρίς όμως καμιά εγγύηση. Παρακαλείστε να μην στηρίζεστε σε αυτό σαν υποκατάστατο ιστοχώρου για ένα συνέδριο. Επιπρόσθετα, συνήθως αναβαθμίζουμε το σύστημα κάθε Πέμπτη πρωί, επομένως ενδέχεται μερικές φορές για μικρό χρονικό διάστημα ο ιστοχώρος να μην λειτουργεί κατά την διάρκεια αυτού του διαστήματος.

source: The target audience is practitioners in HE and FE, although the site may also be of interest to other formal and informal educational sectors. We accept that there will be a higher percentage of consumers than contributors, however over time we hope to increase the level of engagement with the site, encouraging a larger number of educators to share and discuss their ideas and practice.
el: Το ακροατήριο στο οποίο στοχεύει ο ιστοχώρος αυτός είναι επαγγελματίες στην Μέση και --- Εκπαίδευση, παρόλο που μπορεί επίσης να ενδιαφέρει άλλους επίσημους και άτυπους εκπαιδευτικούς τομείς. Αντιλαμβανόμαστε ότι το ποσοστό των καταναλωτών θα είναι μεγαλύτερο από αυτό των ατόμων που συνεισφέρουν στον ιστοχώρο. Ωστόσο με την πάροδο του χρόνου ελπίζουμε να αυξηθεί το επίπεδο εμπλοκής με τον ιστοχώρο, ενθαρρύνοντας έτσι μεγαλύτερο αριθμό εκπαιδευτικών να μοιραστούν και να συζητήσουν τις ιδέες και τις πρακτικές τους.

source: Then either 'edit' to change your name and other details, 'edit picture' to change or add your picture, or 'change password' to change your password.
el: Κατόπιν είτε πατήστε στο 'Επεξεργασία' για να αλλάξετε το όνομά σας και άλλες πληροφορίες, 'Επεξεργασία εικόνας' για να αλλάξετε ή να προσθέσετε την εικόνα σας, ή τέλος το 'Αλλαγή Κωδικού Πρόσβασης' για να αλλάξετε τον κωδικό πρόσβασης στο Cloudworks.

source: There are two key concepts associated with Cloudworks - the notion of 'Clouds' and 'Cloudscapes'.
el: Υπάρχουν δύο βασικές έννοιες που συνδέονται με τα Cloudworks - η έννοια των 'Clouds' και των 'Cloudscapes'.

source: This URL will work for one week. After activating your account you can login with your username, !username.
el: Αυτό το URL θα είναι ενεργό για μια εβδομάδα. Μετά την ενεργοποίησή του λογαριασμού σας μπορείτε να συνδεθείτε χρησιμοποιώντας το όνομα χρήση που επιλέξατε, !username.

source: This cloudscape is <b>not</b> open for anybody to post clouds to.
el: Αυτό το cloudscape <b>δεν</b> είναι ανοικτό για όλους για προσθήκη clouds

source: This cloudscape is open for anybody to post clouds to.
el: Αυτό το cloudscape είναι ανοικτό για όλους για προσθήκη clouds.

source: This is an experimental feature. If you have any problems, please contact us at !email!
el: Αυτή η λειτουργία είνα ακόμα σε πειραματικό στάδιο. Εάν αντιμετωπίσετε οποιοδήποτε πρόβλημα παρακαλούμε επικοινωνήστε μαζί μας στο !e-mail!

source: This new password should be changed as soon as possible. Log in and change your password by going to your profile page
el: Συμβουλεύεστε να αλλάξετε τον νέο αυτό κωδικό το συντομότερο δυνατό. Συνδεθείτε και αλλάξτε τον κωδικό σας πηγαίνοντας στη σελίδα του προφίλ σας

source: This user does not exist
el: Αυτός ο χρήστης δεν υπάρχει

source: Title
el: Τίτλος

source: Title !optional
el: Τίτλος !optional

source: Title !required!
el: Τίτλος !required!

source: To add a Twitter stream to a Cloudscape go to the Cloudscape and click on edit. Add your [link-twit](#) hash tag[/link] in the Twitter tag box. For more information about setting up a #tag and Twitter archive please see [link-c2524]'Using Twitter in Cloudworks'[/link]
el: Για να προσθέσετε ένα Twitter stream σε Cloudscape πηγαίνετε στο Cloudscape και κάντε κλικ στο κουμπί Επεξεργασία. Προσθέστε το [link-twit](#) hash tag[/link] σας στο πλαίσιο Twitter tag. Για περισσότερες πληροφορίες σχετικά με την δημιουργία #tag και αρχείου Twitter μπορείτε να διαβάσετε τον οδηγό [link-c2524]'Χρήση του Twitter στο Cloudworks'[/link]

source: To create a Cloud click on the 'Create a Cloud' link. Enter a short title and a summary - these will appear on the 'All Clouds' page and give an indication of what your Cloud is about. Then enter a description - you can include url links, images, etc. You can also provide a URL for more information. You can tag the Cloud in terms of 'tool', 'pedagogy', 'discipline' and 'other'. Clicking on the tag list at the top will list Clouds according to how they have been tagged using these categories. You can preview to see what your Cloud will look like and then submit. A Cloudscape is produced in much the same way. Once your Cloud has been created you can add it to one or more Cloudscapes. You can also go back and edit the Cloud or delete it. Other people registered on Cloudworks are able to add comments to any Clouds or Cloudscapes you produce.
el: Για να δημιουργήσετε ένα Cloud κάντε κλικ στον σύνδεσμο 'Δημιουργία Cloud'. Εισάγετε έναν σύντομο τίτλο και μια περίληψη - αυτά θα εμφανίζονται στη σελίδα ''Ολα τα Clouds' και θα υποδηλώνουν το θέμα του συγκεκριμένου Cloud. Έπειτα εισάγετε μια περιγραφή - μπορείτε να συμπεριλάβετε συνδέσμους URL, εικόνες κ.α. Μπορείτε επίσης να παρέχετε ένα URL για περισσότερες πληροφορίες. Μπορείτε να προσθέσετε ετικέτες στο Cloud σας όσον αφορά το εργαλείο, την παιδαγωγία που αφορά, το γνωστικό πεδίο με το οποίο σχετίζεται ή με κάποιο άλλο παράγοντα. Κάνοντας κλικ στον κατάλογο ετικετών στην κορυφή της σελίδας η λίστα με τα Clouds θα ομαδοποιηθεί με βάση τις ετικέτες που τους τοποθετήθηκαν σύμφωνα με τις τέσσερις αυτές κατηγορίες. Μπορείτε να δείτε πώς θα φαίνεται το Cloud σας πριν να το δημοσιεύσετε. Ένα Cloudscape δημιουργείται με τον ίδιο σχεδόν τρόπο. Μόλις δημιουργηθεί το Cloud σας μπορείτε να το προσθέσετε σε ένα ή περισσότερα Cloudscapes. Μπορείτε επίσης να επιστρέψετε και να επεξεργαστείτε το Cloud ή να το διαγράψετε. Άτομα που εγγράφονται στο Cloudworks μπορούν να προσθέσουν σχόλια σε οποιοδήποτε από τα δικά σας Clouds ή Cloudscapes.

source: Top 10
el: Τα 10 Δημοφιλέστερα

source: Tweets for !name
el: Tweets για !name

source: Tweets for !tag
el: Tweets για !tag

source: Twitter Username
el: Όνομα χρήστη στο Twitter

source: Twitter tag
el: Ετικέττα Twitter

source: Twitter username
el: Όνομα χρήστη Twitter

source: Unlike many existing educational repositories, the emphasis is on building a dynamic collection of ideas and experiences; via a variety of educational content (learning designs, case studies, resources and tools) plus active discussions about the use and effectiveness of this content in different contexts. The voice of users of the site, their experience, reviews and reflections on the content of the site is a central feature. We plan to do this in the following ways:
el: Αντίθετα από πολλές υπάρχουσες εκπαιδευτικές αποθήκες, εδώ δίνεται έμφαση στην οικοδόμηση μιας δυναμικής συλλογής ιδεών και πρακτικών εμπειριών; μέσω μιας μεγάλης ποικιλίας εκπαιδευτικού περιεχομένου (σχέδια μάθησης, μελέτες περίπτωσης, πόροι και εργαλεία) καθώς και τις ενεργές συζητήσεις για τη χρήση και την αποτελεσματικότητα αυτού του περιεχομένου σε διαφορετικά πλαίσια. Το χαρακτηριστικό γνώρισμα του ιστοχώρου είναι η φωνή των χρηστών του ιστοχώρου, η εμπειρία τους, η κριτική τους σκέψη και οι απόψεις τους γύρω από το περιεχόμενο του ιστοχώρου. Σχεδιάζουμε να πετύχουμε αυτό τον στόχο με τους ακόλουθους τρόπους:

source: Upcoming Deadlines
el: Προσεχείς προθεσμίες

source: Upcoming deadlines
el: Προσεχή προθεσμίες

source: Username
el: Όνομα χρήστη

source: Users
el: Χρήστες

source: Videos: !site_link
el: Βίντεο: !site_link

source: View all !count Clouds
el: Δείτε και τα !count Clouds

source: View all (!total)
el: Προβολή όλων (!total)

source: Want to add embedded content?
el: Θέλετε να προσθέσετε ενσωματωμένο περιεχόμενο;

source: We also have some [link-tip]tips and hints for using Cloudworks[/link].
el: Μπορείτε επίσης να διαβάσετε μερικές [link-tip]Συμβουλές και Υποδείξεις για τη χρήση τουCloudworks [/link].

source: We are sorry, but your activation has failed. Please contact !email! for assistance.
el: Απολογούμαστε, αλλά η ενεργοποίηση του λογαριασμού σας απέτυχε. Παρακαλώ επικοινωνήστε μαζί μας στο !email! για περεταίρω βοήθεια

source: We have made it really easy to embed or link to papers, slideshows, videos, learning designs and pictures etc. For more information on how to do this see [link-c2522]'Sharing pictures, videos, case studies and ideas through links and embeds'[/link]
el: Έχουμε κάνει πραγματικά απλή την ενσωμάτωση ή την προσθήκη συνδέσμου σε έγγραφα, παρουσιάσεις, βίντεο, σχέδια μάθησης, φωτογραφίες κ.α. Για περισσότερες πληροφορίες σχετικά με το πώς να το κάνετε αυτές τις λειτουργίες δείτε τον οδηγό [link-c2522]'Πώς να μοιράζεστε εικόνες, βίντεο, μελέτες περίπτωσης και ιδέες μέσω συνδέσμων και ενσωματωμένου περιεχομένου'[/link]

source: We suggest the following sites:
el: Εισηγούμαστε τους ακόλουθους ιστοχώρους:

source: We would love to hear your suggestions and comments about the Cloudworks site. Please e-mail us at !email-link!. You can also use this address to report bugs and any issues with content.
el: Θα θέλαμε πολύ να ακούσουμε τις προτάσεις και τα σχόλιά σας σχετικά με τον ιστοχώρο του Cloudworks. Παρακαλούμε στείλτε μας τα μηνύματά σας στη διεύθυνση!email-link!. Μπορείτε επίσης να χρησιμοποιήσετε τη διεύθυνση αυτή για να αναφέρετε πιθανά σφάλματα και προβλήματα σχετικά με το περιεχόμενο.

source: Webpage
el: Ιστοσελίδα

source: What is the difference between a Cloud and a Cloudscape?
el: Παια είναι η διαφορά μεταξύ Cloud και Cloudscape?

source: When you first register you will be send a confirmation e-mail automatically. This will usually happen immediately but in unusual cases may take longer. Sometimes the automatic e-mail will end up in a spam folder so please also check there. If you still haven't received an email after about an hour please contact the team !email-link!
el: Όταν εγγραφείτε για πρώτη φορά στο Cloudworks θα σας σταλεί αυτόματα ένα email το οποίο θα επιβεβαιώνει την εγγραφή σας. Συνήθως αυτό συμβαίνει αμέσως αλλά σε ασυνήθιστες περιπτώσεις μπορεί να πάρει περισσότερο χρόνο. Μερικές φορές το αυτόματο ηλεκτρονικό μήνυμα μπορεί να καταλήξει στον φάκελλο Ανεπιθύμητων Μηνυμάτων (Spam) γι'αυτό παρακαλώ όπως ελέγξετε και εκεί. Εάν μετά από μια ώρα δεν έχετε ακόμα λάβει μήνυμα ηλεκτρονικού ταχυδρομείου παρακαλώ επικοιemail μετά από μια ώρα παρακαλώ επικοινωνήστε μαζί μας στο !email-link!

source: Who are you looking for?
el: Ποιόν ψάχνετε;

source: Word Docs, PDFs, Powerpoint presentations: !site_link
el: Έγγραφα Word, PDF, Παρουσιάσεις Powerpoint: !site_link

source: You are not the owner of that cloud
el: Δεν είστε ο ιδιοκτήτης αυτού του cloud

source: You can switch off and on the following email preferences:
el: Μπορείτε να ενεργοποιήσετε και να απενεργοποιήσετε τις ακόλουθες προτιμήσεις ηλεκτρονικού ταχυδρομείου:

source: You can [link-ec]view deadlines here[/link].
el: Εδώ μπορείτε να [link-ec]δείτε τις προθεσμίες[/link].

source: You can [link-ep]view past events here[/link].
el: Εδώ μπορείτε να [link-ep]δείτε περασμένα γεγονότα[/link].

source: You can [link-ev]view current and upcoming events here[/link].
el: Εδώ μπορείτε να [link-ev]δείτε τρέχοντα και προσεχή γεγονότα[/link].

source: You can add a Twitter stream to a Cloudscape but not to a Cloud. You can not add a Twitter stream to someone else's Cloudscape unless you have been given admin permission for the cloudscape by the Cloudscape owner. Please note that Tweets are only available from Twitter for 3 months so if you want to keep an enduring record of the discussion you will need to set up a Tweet archive (using a service like !link).
el: Μπορείτε να προσθέσετε ένα Twitter stream σε Cloudscape αλλά όχι σε Cloud. Δεν μπορείτε να προσθέσετε Twitter stream σε Cloudscape άλλου ατόμου εαν δεν σας έχουν δοθεί δικαιώματα διαχείρισης του cloudscape από τον ιδιοκτήτη του. Παρακαλώ σημειώστε ότι τα Tweets είναι διαθέσιμα από το Twitter μόνο για 3 μήνες, οπότε αν θέλετε μια διαρκή καταγραφή της συζήτησης θα πρέπει να δημιουργήσετε ένα αρχείο Tweet (χρησιμοποιώντας υπηρεσίες όπως !link).

source: You can also search for [link-up]people[/link] and [link-ui]institutions[/link]
el: Μπορείτε επίσης να αναζητήσετε [link-up]άτομα[/link] και [link-ui]οργανισμούς[/link]

source: You can also view [link-ev]current and upcoming events here[/link] and [link-ep]past events[/link].
el: Μπορείτε επίσης να δείτε εδώ [link-ev]τρέχοντα και μελλοντικά γεγονότα[/link] και [link-ep]περασμένα γεγονότα[/link].

source: You can change all of these on your profile page:
el: Μπορείτε να αλλάξετε όλα αυτά στην σελίδα του προφίλ σας:

source: You can do this by logging-in, clicking on the red tab with your name on, and choosing 'E-mail Preferences'.
el: Μπορείτε να το κάνετε αυτό αφού συνδεθείτε στο Cloudworks. Κάντε κλικ στην κόκκινη ετικέτα με το όνομά σας, και την επιλέξτε 'Προτιμήσεις Ηλεκτρονικού Ταχυδρομείου'

source: You can find answers to common questions about using this site in [link-faq]our FAQ[/link]. The [link-cs1911]Using Cloudworks cloudscape[/link] contains further information on how to use the site.
el: Μπορείτε να βρείτε απαντήσεις στις συνήθεις ερωτήσεις σχετικές με την χρήση αυτού του ιστοχώρου στην σελίδα [link-faq]Συνήθεις ερωτήσεις[/link]. Το άρθρο [link-cs1911]Χρήση του Cloudworks cloudscape[/link] περιέχει επιπλέον πληροφορίες για το πώς να χρησιμοποιήσετε τον ιστοχώρο αυτό.

source: You can set up a profile and include some information about yourself. Your profile page automatically lists any Clouds you have created. You can follow both people and Cloudscapes. Your profile page indicates the Cloudscapes you are following, who you are following and who is following you.
el: Μπορείτε να δημιουργήσετε ένα προφίλ που να περιλαμβάνει πληροφορίες για τον εαυτό σας. Η σελίδα του προφίλ σας περιέχει αυτόματα την λίστα με τα Clouds που έχετε δημιουργήσει. Μπορείτε να λαμβάνετε ενημερώσεις (follow) τόσο άτομα όσο και Cloudscapes. Η σελίδα του προφίλ σας θα δείχνει τα Cloudscapes στα οποία είστε follower, το άτομα στα οποία είστε followers και ποιοί είναι οι followers σου.

source: You can view everything available on the site, but if you want to create Clouds or Cloudscapes or if you want to add comments, then you need to create an account.
el: Μπορείτε να δείτε όλο το διαθέσιμο υλικό του ιστοχώρου, αλλά εάν θέλετε να δημιουργήσετε Clouds ή Cloudscapes ή αν θέλετε να προσθέσετε σχόλια τότε θα πρέπει να δημιουργήσετε λογαριασμό.

source: You do not have admin permissions for that cloudscape
el: Δεν έχετε δικαίωμα διαχειρηστή για αυτό το cloudscape

source: You do not have edit permission for that cloud.
el: Δεν έχετε δικαίωμα επεξεργασίας για αυτό το cloud

source: You do not have edit permission for that comment.
el: Δεν έχετε δικαίωμα επεξεργασίας αυτού του σχολίου.

source: You do not have edit permission for that content.
el: Δεν έχετε δικαίωμα επεξεργασίας αυτού του περιεχομένου.

source: You do not have edit permission for that embed.
el: Δεν έχετε δικαίωμα επεξεργασίας αυτού του ενσωματωμένου περιεχομένου.

source: You do not have edit permission for that link.
el: Δεν έχετε δικαίωμα επεξεργασίας αυτού του link

source: You do not have permission to add clouds to that cloudscape
el: Δεν έχετε δικαίωμα προσθήκης cloud σε αυτό το cloudscape

source: You do not have permission to view this page.
el: Δεν έχετε άδεια να δείτε αυτή τη σελίδα

source: You have just been sent an email containing account activation instructions.
el: Μόλις σας έχει αποσταλεί ένα e-mail που περιέχει οδηγίες ενεργοποίησης του λογαριασμού σας.

source: You have successfully deleted the cloud '!title'.
el: Η διαγραφή του cloud '!title' έχει ολοκληρωθεί επιτυχώς.

source: You have successfully deleted the cloudscape '!title'.
el: Έχετε διαγράψει επιτυχώς αυτό το cloudscape '!title'.

source: You have successfully deleted the comment.
el: Έχετε διαγράψει επιτυχώς αυτό το σχόλιο

source: You have successfully deleted the content.
el: Έχετε διαγράψει επιτυχώς το περιεχόμενο.

source: You have successfully deleted the news '!title'.
el: Έχετε διαγράψει επιτυχώς την είδηση '!title'.

source: You may find that you have to reduce the size of the picture or compress the file to upload it:
el: Μπορεί να διαπιστώσετε ότι χρειάζετε να μειώσετε το μέγεθος της εικόνας ή συμπίεσετε το αρχείου για να μπορείτε να το φορτώσετε:

source: You might also find [link-c2525]Setting up a conference Cloudscape[/link] useful.
el: Μπορείτε επίσης να βρείτε χρήσιμο τον οδηγό για [link-c2525]Δημιουργία μιας διάσκεψης στο Cloudscape[/link].

source: You might like to [link-tag]add some tags to the cloud[/link] to help people find it or [link-view]view the cloud[/link]
el: Θα ήταν καλή ιδέα να [link-tag]προσθέσετε μερικές ετικέτες στο cloud[/link] για να μπορούν οι χρήστες να το βρουν ή [link-view]να δουν το cloud[/link]

source: You need to be logged in to view this page.
el: Πρέπει να είστε συνδεδεμένοι για να δείτε αυτή τη σελίδα.

source: You need to be logged on to view this page
el: Πρέπει να συνδεθείτε για να δείτε αυτήν τη σελίδα

source: You or somebody else requested a password remind about your account. If you do not remember your password and want to change it, please click on the following link:
el: Εσείς ή κάποιος άλλος ζήτησε υπενθύμiση του κωδικού πρόσβασης για τον λογαριασμό σας. Αν δε θυμάστε τον κωδικό σας και θέλετε να τον αλλάξετε, παρακαλώ κάντε κλικ στο πιο κάτω σύνδεσμο:

source: You password has been changed
el: Ο κωδικός σας για πρόσβαση στο Cloudworks έχει άλλαξει

source: You will be sent another e-mail with your new 5 character password
el: Θα σας αποσταλεί ακόμη ένα e-mail με τον νέο σας πενταψήφιο κωδικό προσβασης

source: You will receive an email within a few minutes (if you don't, check your spam folder)
el: Θα λάβετε ένα μήνυμα μέσω ηλεκτρονικού ταχυδρομείου μέσα σε λίγα λεπτά - αν όχι ελέγξτε τον φάκελλο Ανεπιθύμητων μηνυμάτων (Spam)

source: Your !item has been flagged for moderation by the system we have in place to reduce spam on Cloudworks.
el: To !item σας έχει τεθεί υπό επιτήρηση από το σύστημα έτσι ώστε να μειωθούν ανεπιθύμητα μηνύματα από το Cloudworks.

source: Your Profile
el: Το προφίλ μου

source: Your Profile Picture
el: Η εικόνα του προφίλ σας

source: Your account has been activated. You can now login.
el: Ο λογαριασμός σας ενεργοποιήθηκε. Μπορείτε τώρα να συνδεθείτε.

source: Your cloud !title has been created!
el: Το Cloud σας με θέμα !title έχει δημιουργηθεί!

source: Your cloudstream
el: Το δικό σου cloudstream

source: Your fullname must contain a space
el: Το ονοματεπώνυμό σας πρέπει να περιέχει κενό διάστημα

source: Your new Cloudscape picture was uploaded
el: Η καινούργια σας εικόνα έχει φορτωθεί στο Cloudscape

source: Your password has been reset and e-mailed to you. Please change this password as soon as possible by following the link in the e-mail.
el: Ο κωδικός σας για πρόσβαση στο Cloudworks έχει επαναπροσδιοριστεί και σταλεί σε εσάς μέσω ηλεκτρονικού ταχυδρομείου. Παρακαλείστε να αλλάξετε αυτόν τον κωδικό πρόσβασης το συντομότερο δυνατό ακολουθώντας τον σύνδεσμο μέσα στο e-mail.

source: Your preferences have been saved
el: Οι προτιμήσεις σας έχουν αποθηκευτεί

source: [link-av]The Cloudworks Vision Statement[/link] outlines the aims of the site. The [link-news]Cloudworks blog[/link] gives current information on what we are working on and our plans for the site.
el: H [link-av]Η Δήλωση του Οράματος του Cloudworks[/link] σκιαγραφεί τους στόχους του ιστοχώρου αυτού. To [link-news]Cloudworks blog[/link] παρέχει επίκαιρες πληροφορίες για τα θέματα με τα οποία ασχολούμαστε και τα σχέδια μας για τον ιστοχώρο του Cloudworks.

source: added by !person
el: προσθήκη από τον/την !person

source: added to !cloud by !person
el: προστέθηκε στο !cloud από τον/την !person

source: added to !title by !person
el: προστέθηκε στο !title από τον/την !person

source: and/or
el: και/ή

source: cloud added to the cloudscape !title
el: προστέθηκε cloud στο cloudscape !title

source: cloud added to the cloudscape !title by !person
el: Προστέθηκε cloud στο cloudscape !title από τον/την !person

source: comma-separated
el: διαχωρισμένα με κόμμα (,)

source: comment
el: σχόλια

source: connect people with similar educational interests through social networking
el: Να συνδέσει τους ανθρώπους με παρόμοια εκπαιδευτικά ενδιαφέροντα μέσω της κοινωνικής δικτύωσης

source: created by !person
el: δημιουργήθηκε από τον/την !person

source: delete
el: διαγραφή

source: delete embedded content
el: Διαγραφή ενσωματωμένου περιεχομένου

source: developer
el: προγραμματιστής

source: e.g. collaborative learning, problem based learning, calculus, moodle
el: π.χ. συνεργατική μάθηση, μάθηση μέσω επίλυσης προβλημάτων, μαθηματικά, moodle

source: edit
el: επεξεργασία

source: edit embedded content
el: Επεξεργασία ενσωματωμένου περιεχομένου

source: hide
el: απόκρυψη

source: image by !person
el: εικόνα από !person

source: lead developer
el: Επικεφαλής προγραμματιστής

source: make primary
el: ανάθεση ως βασικό

source: new cloud created by !person
el: νέο cloud δημιουργήθηκε από !person

source: new cloudscape created by !person
el: νέο cloud δημιουργήθηκε από τον/την !person

source: new comment on the cloud !cloud by !person
el: νέο σχόλιο στο cloud !cloud από τον/την !person

source: new content on !title by !person
el: νέο περιεχόμενο στο !title από τον/την !person

source: new embedded content added to the cloud !title by !person
el: προστέθηκε νέο ενσωματωμένο περιεχόμενο στο cloud !title από τον/την !person

source: new link on !title added by !person
el: προστέθηκε νέο link στο !title από τον/την !person
